Revit 2027 API
DWFImportOptions.SetSheetViews Method
 Set sheet views where DWF markups are imported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSheetViews(
	IList<ElementId> sheetViews
)
Public Sub SetSheetViews (
	sheetViews As IList(Of ElementId)
)
public:
void SetSheetViews(
	IList<ElementId^>^ sheetViews
)
member SetSheetViews :
        sheetViews : IList<ElementId> -> unit
Parameters
sheetViews IList<ElementId>
 An array of imported sheet views.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DWFImportOptions Class
Autodesk.Revit.DB Namespace